# 2 Напишите программу, которая циклом формирует числа от 0 до 30.
# Запишите эти цифры в список

numbers = []

for i in range(31):
    numbers.append(i)
                         # append - добавить
print(numbers)