# 1. Написать программу, которая выводит на экран список четных чисел от 10 до 30.


# range - выводит все четные числа из диапазона 10 - 30 (10 12 14 16 18 20 22 24 26 28)
for number in range(10,30):
    if number % 2 == 0:
        print(number)

# 2. Написать программу, которая принимает от пользователя ввод трех имен и добавляет их в список names
# Выведите список на экран
# Выведите количество элементов списка
# Выведите отдельно первый элемент списка
# Выведите отдельно последний элемент списка

# {} - словарик (памятка)
# Программа, принимающая от пользователя ввод трех имен и добавляющая их в список names

names = [] # - тут будет список

for i in range(3):
    name = input(f"Введите имя ({i + 1} из 3): ")  # Уточнение, какое из имен вводится {i + 1} (счетчик)
    names.append(name)  # append() добавляет в конец списка элемент, переданный ему в качестве аргумента.
                        # Как и все методы в Python, он вызывается через оператор . (точка).

                        # extend() добавляет новые элементы в конец списка
print("Список имен:", names)
print("Количество элементов в списке:", len(names))  # Нужно использовать len(users) для подсчета
print("Первый элемент списка:", names[0])
print("Последний элемент списка:", names[-1])

# 3. в получившийся во 2 задании список names добавьте имя Igor во 2 позицию
# выведите на экран индекс этого элемента
# удалите имя Igor из списка

names.insert(1, "Igor")  # Добавляем Igor во 2 позицию
print("Индекс элемента 'Igor':", names.index("Igor"))
names.remove("Igor")  # Удаляем - Igor
print("Список имен:", names)
